ht32-holtek/HT32_STD_7xxxx_FWLib/library/HT32F7xxxx_Driver/inc/ht32f7xxxx_tm.h
#define IS_TM_MMSEL(x)  (IS_TM_MMSEL_RESET(x)   || \
                         IS_TM_MMSEL_ENABLE(x)  || \
                         IS_TM_MMSEL_UPDATE(x)  || \
                         IS_TM_MMSEL_CH0CC(x)   || \
                         IS_TM_MMSEL_CH0OREF(x) || \
                         IS_TM_MMSEL_CH1OREF(x) || \
                         IS_TM_MMSEL_CH2OREF(x) || \
                         IS_TM_MMSEL_CH3OREF(x) || \
                         IS_TM_MMSEL_CH4OREF(x) || \
                         IS_TM_MMSEL_CH5OREF(x) || \
                         IS_TM_MMSEL_CH6OREF(x) || \
                         IS_TM_MMSEL_CH7OREF(x))

/**
 * @brief Used to check parameter of the TM slave mode.
 */
#define IS_TM_SLAVE_MODE(x) ((x == TM_SMSEL_RESTART) || (x == TM_SMSEL_PAUSE) || \
                               (x == TM_SMSEL_TRIGGER) || (x == TM_SMSEL_STIED))
/**
 * @brief Used to check parameter of the TM flag.
 */
#define IS_TM_FLAG_CH0CC(x) (x == TM_FLAG_CH0CC)
#define IS_TM_FLAG_CH1CC(x) (x == TM_FLAG_CH1CC)
#define IS_TM_FLAG_CH2CC(x) (x == TM_FLAG_CH2CC)
#define IS_TM_FLAG_CH3CC(x) (x == TM_FLAG_CH3CC)
#define IS_TM_FLAG_CH4CC(x) (0)
#define IS_TM_FLAG_CH5CC(x) (0)
#define IS_TM_FLAG_CH6CC(x) (0)
#define IS_TM_FLAG_CH7CC(x) (0)
#define IS_TM_FLAG_CH0OC(x) (x == TM_FLAG_CH0OC)
#define IS_TM_FLAG_CH1OC(x) (x == TM_FLAG_CH1OC)
#define IS_TM_FLAG_CH2OC(x) (x == TM_FLAG_CH2OC)
#define IS_TM_FLAG_CH3OC(x) (x == TM_FLAG_CH3OC)
#define IS_TM_FLAG_UEV(x)   (x == TM_FLAG_UEV)
#define IS_TM_FLAG_UEV2(x)  (x == TM_FLAG_UEV2)
#define IS_TM_FLAG_TEV(x)   (x == TM_FLAG_TEV)
#define IS_TM_FLAG_BRK0(x)  (x == TM_FLAG_BRK0)
#define IS_TM_FLAG_BRK1(x)  (x == TM_FLAG_BRK1)
#define IS_TM_FLAG(x) (IS_TM_FLAG_CH0CC(x) || \
                       IS_TM_FLAG_CH1CC(x) || \
                       IS_TM_FLAG_CH2CC(x) || \
                       IS_TM_FLAG_CH3CC(x) || \
                       IS_TM_FLAG_CH4CC(x) || \
                       IS_TM_FLAG_CH5CC(x) || \
                       IS_TM_FLAG_CH6CC(x) || \
                       IS_TM_FLAG_CH7CC(x) || \
                       IS_TM_FLAG_CH0OC(x) || \
                       IS_TM_FLAG_CH1OC(x) || \
                       IS_TM_FLAG_CH2OC(x) || \
                       IS_TM_FLAG_CH3OC(x) || \
                       IS_TM_FLAG_UEV(x)   || \
                       IS_TM_FLAG_UEV2(x)  || \
                       IS_TM_FLAG_TEV(x)   || \
                       IS_TM_FLAG_BRK0(x)  || \
                       IS_TM_FLAG_BRK1(x))

/**
 * @brief Used to check parameter of the TM flag for \ref TM_ClearFlag function.
 */
#define IS_TM_FLAG_CLR(x) (((x & 0xFFFFFA00) == 0) && (x != 0))
/**
 * @brief Used to check value of TM digital filter.
 */
#define IS_TM_FILTER(x) (x <= 0xF)

/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------------------------------------*/
/** @defgroup TM_Exported_Functions TM exported functions
  * @{
  */
#define TM_SetCaptureCompare0(TMx, Cmp)       TM_SetCaptureCompare(TMx, TM_CH_0, Cmp)
#define TM_SetCaptureCompare1(TMx, Cmp)       TM_SetCaptureCompare(TMx, TM_CH_1, Cmp)
#define TM_SetCaptureCompare2(TMx, Cmp)       TM_SetCaptureCompare(TMx, TM_CH_2, Cmp)
#define TM_SetCaptureCompare3(TMx, Cmp)       TM_SetCaptureCompare(TMx, TM_CH_3, Cmp)

#define TM_ForcedOREF0(TMx, ForcedAction)     TM_ForcedOREF(TMx, TM_CH_0, ForcedAction)
#define TM_ForcedOREF1(TMx, ForcedAction)     TM_ForcedOREF(TMx, TM_CH_1, ForcedAction)
#define TM_ForcedOREF2(TMx, ForcedAction)     TM_ForcedOREF(TMx, TM_CH_2, ForcedAction)
#define TM_ForcedOREF3(TMx, ForcedAction)     TM_ForcedOREF(TMx, TM_CH_3, ForcedAction)

#define TM_SetAsymmetricCompare0(TMx, Cmp)    TM_SetAsymmetricCompare(TMx, TM_CH_0, Cmp)
#define TM_SetAsymmetricCompare1(TMx, Cmp)    TM_SetAsymmetricCompare(TMx, TM_CH_1, Cmp)
#define TM_SetAsymmetricCompare2(TMx, Cmp)    TM_SetAsymmetricCompare(TMx, TM_CH_2, Cmp)
#define TM_SetAsymmetricCompare3(TMx, Cmp)    TM_SetAsymmetricCompare(TMx, TM_CH_3, Cmp)

#define TM_GetCaptureCompare0(TMx)            TM_GetCaptureCompare(TMx, TM_CH_0)
#define TM_GetCaptureCompare1(TMx)            TM_GetCaptureCompare(TMx, TM_CH_1)
#define TM_GetCaptureCompare2(TMx)            TM_GetCaptureCompare(TMx, TM_CH_2)
#define TM_GetCaptureCompare3(TMx)            TM_GetCaptureCompare(TMx, TM_CH_3)

void TM_DeInit(HT_TM_TypeDef* TMx);
void TM_TimeBaseInit(HT_TM_TypeDef* TMx, TM_TimeBaseInitTypeDef* TimeBaseInit);
void TM_OutputInit(HT_TM_TypeDef* TMx, TM_OutputInitTypeDef* OutInit);
void TM_CaptureInit(HT_TM_TypeDef* TMx, TM_CaptureInitTypeDef* CapInit);
void TM_PwmInputInit(HT_TM_TypeDef* TMx, TM_CaptureInitTypeDef* CapInit);
void TM_TimeBaseStructInit(TM_TimeBaseInitTypeDef* TimeBaseInit);
void TM_OutputStructInit(TM_OutputInitTypeDef* OutInit);
void TM_CaptureStructInit(TM_CaptureInitTypeDef* CapInit);
void TM_Cmd(HT_TM_TypeDef* TMx, ControlStatus NewState);
void TM_ItiExternalClockConfig(HT_TM_TypeDef* TMx, TM_TRSEL_Enum Iti);
void TM_ChExternalClockConfig(HT_TM_TypeDef* TMx, TM_TRSEL_Enum Sel, TM_CHP_Enum Pol, u8 Filter);
#if 0 // M0+ not supported
void TM_EtiExternalClockConfig(HT_TM_TypeDef* TMx, TM_ETIPSC_Enum Psc, TM_ETIPOL_Enum Pol, u8 Filter);
void TM_EtiConfig(HT_TM_TypeDef* TMx, TM_ETIPSC_Enum Psc, TM_ETIPOL_Enum Pol, u8 Filter);
#endif
void TM_PrescalerConfig(HT_TM_TypeDef* TMx, u16 Psc, TM_PSC_RLD_Enum PscReloadTime);
void TM_CounterModeConfig(HT_TM_TypeDef* TMx, TM_CNT_MODE_Enum Mod);
void TM_StiConfig(HT_TM_TypeDef* TMx, TM_TRSEL_Enum Sel);
void TM_DecoderConfig(HT_TM_TypeDef* TMx, TM_SMSEL_Enum DecoderMod, TM_CHP_Enum CH0P, TM_CHP_Enum CH1P);

void TM_ForcedOREF(HT_TM_TypeDef* TMx, TM_CH_Enum TM_CH_n, TM_OM_Enum ForcedAction);
void TM_CRRPreloadCmd(HT_TM_TypeDef* TMx, ControlStatus NewState);
void TM_CHCCRPreloadConfig(HT_TM_TypeDef* TMx, TM_CH_Enum Channel, ControlStatus NewState);
#if 0 // M0+ not supported
void TM_ClearOREFConfig(HT_TM_TypeDef* TMx, TM_CH_Enum Channel, ControlStatus NewState);
#endif
void TM_ChPolarityConfig(HT_TM_TypeDef* TMx, TM_CH_Enum Channel, TM_CHP_Enum Pol);

